Revit 2026 API

# ViewSetWorksharingDisplayMode Method

---

Sets the worksharing display mode for this view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetWorksharingDisplayMode(
	WorksharingDisplayMode displayMode
)
```
```vb
Public Sub SetWorksharingDisplayMode (
	displayMode As WorksharingDisplayMode
)
```
```cpp
public:
void SetWorksharingDisplayMode(
	WorksharingDisplayMode displayMode
)
```
```fsharp
member SetWorksharingDisplayMode :
        displayMode : WorksharingDisplayMode -> unit
```

#### Parameters

displayMode WorksharingDisplayMode
     The desired display mode. "Off" will turn off all worksharing display modes.

| Exception | Condition |
| --- | --- |
| ArgumentException | This View does not support the requested worksharing display mode. |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

Turning on a worksharing display mode will disable other temporary view modes such as reveal hidden elements and temporary hide/isolate.

#### Reference

View Class

Autodesk.Revit.DB Namespace